// 前缀或者后缀字段
window.staticObjectState = {
    privateKey: '###fremember_Pwd18760567910!@#$%^&*(){}?:"><~~',
    storagePrefix: 'fremember_koa_'
}
// 公共处理方法
window.mineLS = {// localStorage
    setItem: (key, value) => {
        localStorage.setItem(`${staticObjectState.storagePrefix}${key}`, value)
    },
    getItem: (key) => {
        return localStorage.getItem(`${staticObjectState.storagePrefix}${key}`)
    },
    removeItem: (key) => {
        localStorage.removeItem(`${staticObjectState.storagePrefix}${key}`)
    },
    clear: () => {
        localStorage.clear()
    }
}
window.mineSS = {// sessionStorage
    setItem: (key, value) => {
        sessionStorage.setItem(`${staticObjectState.storagePrefix}${key}`, value)
    },
    getItem: (key) => {
        return sessionStorage.getItem(`${staticObjectState.storagePrefix}${key}`)
    },
    removeItem: (key) => {
        sessionStorage.removeItem(`${staticObjectState.storagePrefix}${key}`)
    },
    clear: () => {
        sessionStorage.clear()
    }
}
window.showMsg = function (text, icon, hideAfter) {
    // if (heading == undefined) {
    //     var heading = "提示";
    // }
    $.toast({
        text: text,//消息提示框的内容。
        // heading: heading,//消息提示框的标题。
        icon: icon,//消息提示框的图标样式。
        showHideTransition: 'fade',//消息提示框的动画效果。可取值：plain，fade，slide。
        allowToastClose: true,//是否显示关闭按钮。(true 显示，false 不显示)
        hideAfter: hideAfter,//设置为false则消息提示框不自动关闭.设置为一个数值则在指定的毫秒之后自动关闭消息提框
        stack: 1,//消息栈。同时允许的提示框数量
        position: 'top-center',//消息提示框的位置：bottom-left, bottom-right,bottom-center,top-left,top-right,top-center,mid-center。
        textAlign: 'left',//文本对齐：left, right, center。
        loader: true,//是否显示加载条
        //bgColor: '#FF1356',//背景颜色。
        //textColor: '#eee',//文字颜色。
        loaderBg: '#ffffff',//加载条的背景颜色。
        // 会在toast即将出现之前触发
        beforeShow: function () {},
        // 会在toast出现后触发
        afterShown: function () {},
        // 会在toast藏起来之前触发
        beforeHide: function () {},
        // 会在toast藏起来后被触发
        afterHidden: function () {}
    })
}
window.countryLists = [
    '中国大陆 +86',
    '香港 +852',
    '澳门 +853',
    '台湾 +886',
    '韩国 +82',
    '日本 +81',
    '美国 +1',
    '加拿大 +1',
    '英国 +44',
    '新加坡 +65',
    '马来西亚 +60',
    '泰国 +66',
    '越南 +84',
    '菲律宾 +63',
    '印度尼西亚 +62',
    '意大利 +39',
    '俄罗斯 +7',
    '新西兰 +64',
    '荷兰 +31',
    '瑞典 +46',
    '澳大利亚 +61',
    '乌克兰 +380',
    '法国 +33',
    '德国 +49',
    '阿富汗 +93',
    '阿尔巴尼亚 +355',
    '阿尔及利亚 +213',
    '东萨摩亚(美) +1684',
    '安道尔 +376',
    '安哥拉 +244',
    '安圭拉岛(英) +1264',
    '安提瓜和巴布达 +1268',
    '阿根廷 +54',
    '亚美尼亚 +374',
    '阿鲁巴岛 +297',
    '奥地利 +43',
    '阿塞拜疆 +994',
    '巴林 +973',
    '孟加拉国 +880',
    '巴巴多斯 +1246',
    '白俄罗斯 +375',
    '比利时 +32',
    '伯利兹 +501',
    '贝宁 +229',
    '百慕大群岛(英) +1441',
    '不丹 +975',
    '玻利维亚 +591',
    '波斯尼亚和黑塞哥维那 +387',
    '博茨瓦纳 +267',
    '巴西 +55',
    '保加利亚 +359',
    '布基纳法索 +226',
    '布隆迪 +257',
    '喀麦隆 +237',
    '佛得角 +238',
    '开曼群岛(英) +1345',
    '中非 +236',
    '乍得 +235',
    '智利 +56',
    '圣诞岛 +61',
    '科科斯岛 +61',
    '哥伦比亚 +57',
    '科摩罗 +269',
    '刚果 +242',
    '科克群岛(新) +682',
    '哥斯达黎加 +506',
    '克罗地亚 +385',
    '古巴 +53',
    '塞浦路斯 +357',
    '捷克 +420',
    '丹麦 +45',
    '吉布提 +253',
    '多米尼克国 +1767',
    '多米尼加共和国 +1809',
    '厄瓜多尔 +593',
    '埃及 +20',
    '萨尔瓦多 +503',
    '赤道几内亚 +240',
    '厄立特里亚 +291',
    '爱沙尼亚 +372',
    '埃塞俄比亚 +251',
    '福克兰群岛 +500',
    '法罗群岛(丹) +298',
    '斐济 +679',
    '芬兰 +358',
    '法属波里尼西亚 +689',
    '加蓬 +241',
    '冈比亚 +220',
    '格鲁吉亚 +995',
    '加纳 +233',
    '直布罗陀(英) +350',
    '希腊 +30',
    '格陵兰岛 +299',
    '格林纳达 +1473',
    '瓜德罗普岛(法) +590',
    '关岛(美) +1671',
    '危地马拉 +502',
    '几内亚 +224',
    '几内亚比绍 +245',
    '圭亚那 +592',
    '海地 +509',
    '洪都拉斯 +504',
    '匈牙利 +36',
    '冰岛 +354',
    '印度 +91',
    '伊郎 +98',
    '伊拉克 +964',
    '爱尔兰 +353',
    '以色列 +972',
    '科特迪瓦 +225',
    '牙买加 +1876',
    '约旦 +962',
    '柬埔塞 +855',
    '哈萨克斯坦 +7',
    '肯尼亚 +254',
    '基里巴斯 +686',
    '科威特 +965',
    '吉尔吉斯斯坦 +996',
    '老挝 +856',
    '拉脱维亚 +371',
    '黎巴嫩 +961',
    '莱索托 +266',
    '利比里亚 +231',
    '利比亚 +218',
    '列支敦士登 +423',
    '立陶宛 +370',
    '卢森堡 +352',
    '马其顿 +389',
    '马达加斯加 +261',
    '马拉维 +265',
    '马尔代夫 +960',
    '马里 +223',
    '马耳他 +356',
    '马绍尔群岛 +692',
    '马提尼克(法) +596',
    '毛里塔尼亚 +222',
    '毛里求斯 +230',
    '马约特岛 +262',
    '墨西哥 +52',
    '密克罗尼西亚(美) +691',
    '摩纳哥 +377',
    '蒙古 +976',
    '蒙特塞拉特岛(英) +1664',
    '摩洛哥 +212',
    '莫桑比克 +258',
    '缅甸 +95',
    '纳米比亚 +264',
    '瑙鲁 +674',
    '尼泊尔 +977',
    '荷属安的列斯群岛 +599',
    '新喀里多尼亚群岛(法) +687',
    '尼加拉瓜 +505',
    '尼日尔 +227',
    '尼日利亚 +234',
    '纽埃岛(新) +683',
    '诺福克岛(澳) +672',
    '朝鲜 +850',
    '马里亚纳群岛 +1670',
    '挪威 +47',
    '阿曼 +968',
    '巴基斯坦 +92',
    '帕劳(美) +680',
    '巴拿马 +507',
    '巴布亚新几内亚 +675',
    '巴拉圭 +595',
    '秘鲁 +51',
    '波兰 +48',
    '葡萄牙 +351',
    '波多黎各(美) +1',
    '卡塔尔 +974',
    '摩尔多瓦 +373',
    '留尼汪岛 +262',
    '罗马尼亚 +40',
    '卢旺达 +250',
    '阿森松(英) +247',
    '圣赫勒拿 +290',
    '圣克里斯托弗和尼维斯 +1869',
    '圣卢西亚 +1758',
    '圣皮埃尔岛及密克隆岛 +508',
    '圣文森特岛(英) +1784',
    '西萨摩亚 +685',
    '圣马力诺 +378',
    '圣多美和普林西比 +239',
    '沙特阿拉伯 +966',
    '塞内加尔 +221',
    '塞舌尔 +248',
    '塞拉利昂 +232',
    '斯洛伐克 +421',
    '斯洛文尼亚 +386',
    '所罗门群岛 +677',
    '索马里 +252',
    '南非 +27',
    '西班牙 +34',
    '斯里兰卡 +94',
    '苏丹 +249',
    '苏里南 +597',
    '斯威士兰 +268',
    '瑞士 +41',
    '叙利亚 +963',
    '塔吉克斯坦 +992',
    '巴哈马国 +1242',
    '梵蒂冈 +14397',
    '多哥 +228',
    '汤加 +676',
    '特立尼达和多巴哥 +1868',
    '突尼斯 +216',
    '土耳其 +90',
    '土库曼斯坦 +993',
    '特克斯和凯科斯群岛(英) +1649',
    '图瓦卢 +688',
    '乌干达 +256',
    '英国 +44',
    '坦桑尼亚 +255',
    '乌拉圭 +598',
    '乌兹别克斯坦 +998',
    '瓦努阿图 +678',
    '委内瑞拉 +58',
    '维尔京群岛(英) +1340',
    '也门 +967',
    '南斯拉夫 +381',
    '赞比亚 +260',
    '桑给巴尔 +259',
    '津巴布韦 +263'
]
window.username = mineLS.getItem('username')
document.querySelector('.username').innerHTML = window.username